docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-19 Ma 13:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MCMC toolbox for Matlab</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Marko Laine" />
<meta name="description" content="Matlab toolbox for Markov chain Monte Carlo"
 />
<meta name="keywords" content="MCMC, Matlab, adaptive mcmc" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">MCMC toolbox for Matlab</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0701d35">Introduction</a></li>
<li><a href="#orgb3e1f3a">Examples</a></li>
<li><a href="#orgcdeadeb">Code</a></li>
<li><a href="#org97febb1">Downloads</a></li>
<li><a href="#orgb0c2686">References</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0701d35" class="outline-2">
<h2 id="org0701d35">Introduction</h2>
<div class="outline-text-2" id="text-org0701d35">
<p>
The MCMCSTAT Matlab package contains a set of Matlab functions for some Bayesian analyses of mathematical models by Markov chain Monte Carlo simulation. This code might be useful to you if you are already familiar with Matlab and want to do MCMC analysis using it.
</p>

<p>
For a more comprehensive and better documented and maintained software for MCMC, see, e.g. <a href="http://mc-stan.org">Stan</a>. There are some MCMC functions in Mahtworks own <a href="http://www.mathworks.com/access/helpdesk/help/toolbox/stats/">Statistics Toolbox</a>, too.
</p>

<p>
This toolbox provides tools to generate and analyse Metropolis-Hastings MCMC chains using multivariate Gaussian proposal distribution. The covariance matrix of the proposal distribution can be adapted during the simulation according to adaptive schemes described in the references.
</p>

<p>
The code can do the following
</p>

<ul class="org-ul">
<li>Produce MCMC chain for user-written -2*log(likelihood) and -2*log(prior) functions. These will be equal to sum-of-squares cost functions when using Gaussian likelihood and prior.</li>
<li>In case of Gaussian error model, sample the model error variance from the conjugate inverse chi-squared distribution.</li>
<li>Do plots and statistical analyses based on the chain, such as basic statistics, convergence diagnostics, chain timeseries plots, 2 dimensional clouds of points, kernel densities, and histograms.</li>
<li>Calculate densities, cumulative distributions, quantiles, and random variates for some useful common statistical distributions without using Mathworks own statistics toolbox.</li>
</ul>

<p>
The code is self consistent, no additional Matlab toolboxes are used. However, a quite recent version of Matlab is needed. The documentation might get better gradually, but in the mean while please look at the following page:
</p>
</div>
</div>

<div id="outline-container-orgb3e1f3a" class="outline-2">
<h2 id="orgb3e1f3a">Examples</h2>
<div class="outline-text-2" id="text-orgb3e1f3a">
<ul class="org-ul">
<li><a href="examples.html">Examples</a> on using the toolbox for some statistical problems.</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdeadeb" class="outline-2">
<h2 id="orgcdeadeb">Code</h2>
<div class="outline-text-2" id="text-orgcdeadeb">
<p>
The main functions in the toolbox are the following.
</p>

<dl class="org-dl">
<dt><code>mcmcrun.m</code></dt><dd>Matlab function for the MCMC run. The user provides
her own Matlab function to calculate the
"sum-of-squares" function for the likelihood part,
e.g. a function that calculates minus twice the log
likelihood, -2log(p(&theta;;data)). Optionally a prior
"sum-of-squares" function can also be given,
returning -2log(p(&theta;)).
See the example and <a href="mcmcrun.html">help mcmcrun</a> for more details.</dd>
<dt><code>mcmcplot.m</code></dt><dd>This function makes some useful plots of the
generated chain, such as chain time series, 2
dimensional marginal plots, kernel density
estimates, and histograms. See <a href="mcmcplot.html">help mcmcplot</a>.</dd>
<dt><code>mcmcpred.m</code></dt><dd>For certain types of models is is useful to plot
predictive envelopes of model functions by sampling
parameter values from the generated chain. This
functions calls the model function repeatedly while
sampling the unknowns from the chain. It calculates
probability regions with respect to a given "time"
variable of the model. See the <a href="examples.html">examples</a>.</dd>
</dl>
</div>
</div>


<div id="outline-container-org97febb1" class="outline-2">
<h2 id="org97febb1">Downloads</h2>
<div class="outline-text-2" id="text-org97febb1">
<p>
The full Matlab code and this documentation are available from <a href="https://github.com/mjlaine/mcmcstat">GitHub</a>.
</p>

<p>
To install the toolbox clone the folder <code>mcmcstat</code> to a suitable directory and then add Matlab path to that directory.
</p>

<pre class="example">
git clone https://github.com/mjlaine/mcmcstat.git
</pre>

<p>
Alternatively, you can download the whole repository as a zip file from the GitHub page or directly as
<a href="https://github.com/mjlaine/mcmcstat/archive/master.zip">https://github.com/mjlaine/mcmcstat/archive/master.zip</a>
</p>

<p>
Comments are welcome!
</p>
</div>
</div>

<div id="outline-container-orgb0c2686" class="outline-2">
<h2 id="orgb0c2686">References</h2>
<div class="outline-text-2" id="text-orgb0c2686">
<p>
H. Haario, M. Laine, A. Mira and E. Saksman, 2006. <i>DRAM: Efficient adaptive MCMC</i>, Statistics and Computing <b>16</b>, pp. 339-354. <a href="http://dx.doi.org/10.1007/s11222-006-9438-0">doi: 10.1007/s11222-006-9438-0</a>
</p>

<p>
H. Haario, E. Saksman and J. Tamminen, 2001. <i>An adaptive Metropolis algorithm</i>
Bernoulli <b>7</b>, pp. 223-242. <a href="http://dx.doi.org/10.2307/3318737">doi: 10.2307/3318737</a>
</p>

<hr>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marko Laine</p>
<p class="date">Created: 2018-11-19 Ma 13:33</p>
<p class="validation"></p>
</div>
</body>
</html>